Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །རྣམ་པར་འདྲེན་པ་ཉིད་འགྱུར་ཞེས། །དེ་དག་མི་གཙོས་ལུང་བསྟན་ཏོ།
en: Become guides of the world. {47}

source: །དགེ་སློང་དང་ནི་དགེ་སློང་མ།
en: Bhikṣus and bhikṣuṇīs,

source: །དགེ་བསྙེན་ཕ་དང་དགེ་བསྙེན་མ།
en: Upāsakas and upāsikās—

source: །སྲོག་ཆགས་བྱེ་བ་བདུན་ཅུ་དྲུག །གང་དག་མདོ་སྡེ་འདི་ཐོས་པ།
en: Seven hundred and sixty million beings— All heard this sūtra. {48}

source: །དེ་དག་མི་གཙོས་ལུང་བསྟན་ཏེ།
en: The Lord of humans prophesied That they would see as many guides of the world

source: །བྱང་ཆུབ་སྤྱོད་པ་རབ་སྤྱོད་ཅིང་། །གང་གཱའི་བྱེ་མ་མཉམ་པ་ཡི།
en: As there are grains of sand in the Ganges While practicing bodhisattva conduct. {49}

source: །འཇིག་རྟེན་འདྲེན་པ་མཐོང་བར་འགྱུར།
en: “They will make offerings to them all,

source: །སངས་རྒྱས་ཡེ་ཤེས་རབ་ཚོལ་བས། །ཐམས་ཅད་ལ་ཡང་མཆོད་པ་བྱེད། །མདོ་སྡེ་བླ་ན་མེད་པ་འདི། །དེ་དང་དེར་ཡང་ཐོས་པར་འགྱུར།
en: Seeking the wisdom of enlightenment, And here and there they will hear This unsurpassable sūtra. {50} “They will make unsurpassable offerings

source: །བྱམས་པ་ཡི་ནི་སངས་རྒྱས་ལ། །བླ་ན་མེད་པའི་མཆོད་བྱས་ཏེ།
en: To Buddha Maitreya.

source: །དམ་པའི་ཆོས་མཆོག་བཟུང་ནས་ནི།
en: They will possess the highest Dharma

source: །བདེ་བ་ཅན་དུ་འགྲོ་བར་འགྱུར།
en: And they will go to Sukhāvatī. {52} “There they will make offerings

source: །གང་ན་སངས་རྒྱས་རྡུལ་བྲལ་བ།
en: To the stainless buddha,

source: །ཚེ་དཔག་མེད་པ་དེ་བཞིན་གཤེགས།
en: The Tathāgata Amitāyus,

source: །དེ་ལ་བྱང་ཆུབ་མཆོག་གི་ཕྱིར། །མཆོད་པ་དག་ཀྱང་བྱེད་པར་འགྱུར།
en: For the sake of supreme enlightenment. {53}

source: །མདོ་སྡེ་དམ་པ་འདི་ཐོས་ན།
en: “Having heard this unsurpassable sūtra

source: །མ་འོངས་པ་ཡི་བསྐལ་པར་ནི།
en: They will not go in future

source: །གྲངས་མེད་བདུན་ཅུ་རྩ་གསུམ་དུ། །ངན་འགྲོ་རྣམས་སུ་ཡང་མི་འགྲོ།
en: To the lower existences For seventy-three countless eons. {54}

source: །ཕྱི་མའི་དུས་ལ་སུ་དག་ནི།
en: “Those who in future times

source: །མདོ་སྡེ་དམ་པ་ཉན་འགྱུར་ཞིང་།
en: Listen to this unsurpassable sūtra,

source: འཆང་ངམ་ཀློག་པར་བྱེད་པ་ཡང་།
en: And keep it and read it,

source: །དེ་དག་ཀུན་གྱིས་ང་ལ་མཆོད།
en: Will all be honoring me. {55} “I make this declaration

source: །ཇི་སྙེད་མདུན་ན་འདུག་པ་རྣམས། །ཐམས་ཅད་ལ་ཡང་བསྒོ་བྱ་སྟེ།
en: To all those who are standing before me.

source: །ངས་ནི་དཀའ་བས་ཐོས་པ་ཡི། །བྱང་ཆུབ་འདི་ཡང་ཡོངས་སུ་གཏད།
en: I bestow this enlightenment gained with difficulty.” {56}

source: །ཏིང་ངེ་འཛིན་རྗེས་སུ་གཏད་པའི་ལེའུ་སྟེ་བཅྭ་བརྒྱད་པའོ།། །།དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: Conclusion of the eighteenth chapter, “The Entrustment of the Samādhi.”

source: གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་ལས་ཡོན་ཏན་གྱི་ཕན་ཡོན་བསམ་གྱིས་མི་ཁྱབ་ཅིང་དཔག་ཏུ་མེད་པ་ཐོས་ནས་མི་སྐྲག་པར་འདོད་པ་དང་མི་དངང་བར་འདོད་པ་དང་དངང་བར་མི་འགྱུར་བར་འདོད་པས་སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པ་ལ་མཁས་པར་བྱའོ།
en: The Teaching of the Inconceivable Dharma of the Buddha Chapter 19 The Bhagavān said to the youth Candraprabha, “Young man, in that way bodhisattva mahāsattvas, having heard the inconceivable and measureless benefits of the qualities that come from the samādhi, the revealed equality of the nature of all phenomena, through wishing not to be fearful, wishing not to be terrified, and not to be gripped by terror, will become learned in the teaching of the inconceivable Dharma of the Buddha.

source: །སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མོས་པར་བྱའོ།
en: Aspire to the inconceivable Dharma of the Buddha.

source: །སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་དྲི་བ་ལ་མཁས་པར་བྱའོ།
en: Be wise in asking questions about the inconceivable Dharma of the Buddha.

source: །སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བཙལ་བ་ལ་མཁས་པར་བྱའོ།
en: Be wise in seeking the inconceivable Dharma of the Buddha.

source: །སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ཐོས་ནས་མི་སྐྲག །མི་དངང་དངང་བར་མི་འགྱུར་བར་བྱའོ།
en: Do not be fearful, do not be terrified, and do not be gripped by terror on hearing the inconceivable Dharma of the Buddha.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་ཇི་ལྟ་བུར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པ་ལ་མཁས་པ་ལགས། སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མོས་པ་དང་སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་འདྲི་བ་ལ་མཁས་པ་དང་སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ཐོས་ན་མི་སྐྲག་མི་དངང་དངང་བར་མི་འགྱུར་བ་ལགས།
en: The youth Candraprabha placed his palms together, bowed toward the Bhagavān, and asked him, “Bhagavān, in this way how do bodhisattva mahāsattvas aspire to the inconceivable Dharma of the Buddha, become wise in asking questions about the inconceivable Dharma of the Buddha, become wise in seeking the inconceivable Dharma of the Buddha, and not be fearful, not be terrified, and not be gripped by terror on hearing the inconceivable Dharma of the Buddha?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་ཉན་ཅིང་ཐོས་ནས་ཀྱང་འཛིན་པ་དང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་འཆང་བ་དང་ཀློག་པ་དང་རབ་ཏུ་འདོན་པ་དང་ཉོན་མོངས་པ་མེད་པར་བསྒོམ་པས་སྒོམ་པར་བྱེད་པ་དང་། མང་དུ་བྱེད་པ་དང་། གཞན་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ན་གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པ་ལ་མཁས་པར་འགྱུར་རོ།
en: The Bhagavān replied to the youth Candraprabha, “Those bodhisattva mahāsattvas who listen to and hear this samādhi, the revealed equality of the nature of all phenomena, and obtain it, understand it, keep it, read it out loud, disseminate it, meditate on it with unadulterated meditation, promulgate it, and make it widely known to others, will become wise in the teaching of the inconceivable Dharma of the Buddha.

source: །སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མོས་པ་དང་སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་འདྲི་བ་ལ་མཁས་པ་དང་སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ཐོས་ན་མི་སྐྲག་མི་དངང་དངང་བར་མི་འགྱུར་རོ།
en: They will aspire to the inconceivable Dharma of the Buddha, they will become wise in asking questions about the inconceivable Dharma of the Buddha, and will not be fearful, will not be terrified, and will not be gripped by terror on hearing the inconceivable Dharma of the Buddha.”

source: །ཡང་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་ལས་ཡོན་ཏན་གྱི་ཕན་ཡོན་བསྒྲུབ་པའི་ཚིག་འདི་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་ངེས་པར་བསྟན་པ་ན་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་ལས་ཡོན་ཏན་གྱི་ཕན་ཡོན་བསྒྲུབ་པའི་ཚིག་དཔག་ཏུ་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་བཅོམ་ལྡན་འདས་ལས་ཐོས་ནས་དེའི་ཚེ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་འདི་རབ་ཏུ་ཐོབ་བོ།
en: “After the youth Candraprabha had been taught by the Bhagavān these words on accomplishing the benefits of the qualities that come from the samādhi, the revealed equality of the nature of all phenomena, he again heard from the Bhagavān countless, innumerable verses describing the benefits of the qualities that come from the samādhi, the revealed equality of the nature of all phenomena; and it was at that time that the youth Candraprabha attained this king of samādhis, the revealed equality of the nature of all phenomena.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ཡང་མངོན་པར་ཤེས་པ་ཆེན་པོ་ཐོབ་པར་གྱུར་ཏོ།
en: Innumerable, countless bodhisattva mahāsattvas attained the great, higher cognitions.

source: །སེམས་ཅན་དཔག་ཏུ་མེད་པ་ཡང་སྙིང་རྗེ་ཆེན་པོར་འཇུག་པ་ལ་མངོན་དུ་ཕྱོགས་པའི་སེམས་སྐྱེས་སོ།
en: Countless beings also developed the motivation that is directed toward great compassion.

source: །རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས། འགུལ་རབ་ཏུ་འགུལ་ཀུན་ཏུ་རབ་ཏུ་འགུལ།
en: It trembled, trembled strongly, and trembled intensely;

source: འུར་འུར་རབ་ཏུ་འུར་འུར་ཀུན་ཏུ་རབ་ཏུ་འུར་འུར། ཤར་ཕྱོགས་དམའ་ན་ནུབ་ཕྱོགས་མཐོ།
en: it quaked, quaked strongly, and quaked intensely;

source: ནུབ་ཕྱོགས་དམའ་ན་ཤར་ཕྱོགས་མཐོ། བྱང་ཕྱོགས་དམའ་ན་ལྷོ་ཕྱོགས་མཐོ། ལྷོ་ཕྱོགས་དམའ་ན་བྱང་ཕྱོགས་མཐོ། མཐའ་དམའ་ན་དབུས་མཐོ། དབུས་དམའ་ན་མཐའ་མཐོ་ཞིང་།
en: the east sank and the west rose, the west sank and the east rose, the north sank and the south rose, the south sank and the north rose, the perimeter sank and the center rose, and the center sank and the perimeter rose.

source: སྣང་བ་དཔག་ཏུ་མེད་པ་ཡང་འཇིག་རྟེན་དུ་བྱུང་།
en: An immeasurable radiance shone in the universe.

source: ལྷའི་སྤོས་ཀྱི་ཆར་ཆེན་པོ་ཡང་མངོན་པར་བབ་བོ།
en: There fell a great rain of divine incense.

source: །ལྷ་དང་ལྷའི་བུ་ཇི་སྙེད་ཆོས་མཉན་པའི་ཕྱིར་འདུས་ཏེ་ལྷགས་པ་དེ་དག་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ནས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་ལས་ཡོན་ཏན་གྱི་ཕན་ཡོན་གྱི་ཚིག་དཔག་ཏུ་མེད་པ་འདི་དག་ཐོས་ནས་ལྷ་དང་ལྷའི་བུ་དེ་དག་ཐམས་ཅད་དགའ་མགུ་ཡི་རངས་ཏེ།
en: Devas and their sons gathered in order to listen to the Dharma. High in the sky they heard the innumerable verses on the benefits of the qualities that come from the samādhi, the revealed equality of the nature of all phenomena.

source: རབ་ཏུ་དགའ་བ་དང་ཚིམ་པ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་ཨ་ལ་ལ་ཞེས་ག་ཞ་སྒྲོགས་པའི་སྒྲ་བྱེད་དོ།
en: All the devas and their sons felt pleased, delighted, thrilled, joyous, happy, and glad, and they emitted cries of joy and laughter.

source: །ལྷའི་མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་ཀྱི་མེ་ཏོག་གི་ཆར་ཆེན་པོ་འབེབས་སོ།
en: They let fall a great rain of divine flowers of various kinds.

source: །ལྷའི་སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ཡང་རབ་ཏུ་རྡུང་ངོ་།
en: They played many thousands of trillions of divine musical instruments.

source: བརྗོད་པ་གཅིག་པའི་དབྱངས་ཀྱིས་ཚིག་འདི་སྐད་ཅེས་འཛེར་ཏོ།
en: And they proclaimed the following words together as one voice:

source: །ཨ་ལ་ལ་བདག་ཅག་གིས་ནི་རྙེད་པ་ལེགས་པར་རྙེད་དེ།
en: “Aho! We have obtained something that is excellent to obtain.

source: འདི་ལྟར་བདག་ཅག་གིས་བཅོམ་ལྡན་འདས་ལས་ཡོན་ཏན་གྱི་ཕན་ཡོན་བསྒྲུབ་པའི་ཚིག་དཔག་ཏུ་མེད་པ་འདི་དག་ཐོས་ནས་བཅོམ་ལྡན་འདས་བདག་ཅག་ཐམས་ཅད་ཀྱང་ཅིག་ཆར་འཐུན་པར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་ཇི་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པ་དེ་བཞིན་དུ། བཅོམ་ལྡན་འདས་བདག་ཅག་ཐམས་ཅད་ཀྱིས་ཀྱང་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་བགྱིའོ།
en: We have heard the innumerable verses on the benefits of the qualities from the Bhagavān. Bhagavān, just as the bodhisattva mahāsattva, the youth Candraprabha, attained this samādhi, the revealed equality of the nature of all phenomena, we also, Bhagavān, will all together at the same time attain this samādhi, the revealed equality of the nature of all phenomena.”

source: །དེ་ནས་དེའི་ཚེ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་བཅོམ་ལྡན་འདས་འཁོར་རྒྱ་མཚོའི་ནང་ན་ཆོས་སྟོན་པ་ལ་དྲི་ཟའི་བུ་གཙུག་ཕུད་ལྔ་ཅན་ཞེས་བྱ་བ་རིམ་གྲོ་དང་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་སིལ་སྙན་ལྔ་བརྒྱ་དང་བཅས་ཏེ་ནམ་མཁའ་ལས་བབས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །དེ་ནས་དྲི་ཟའི་བུ་གཙུག་ཕུད་ལྔ་ཅན་འདི་སྙམ་དུ་སེམས་ཏེ།
en: At the time when the Bhagavān was teaching the Dharma on Vulture Peak Mountain to the assembly that was like an ocean, the gandharva Pañcaśikha, in order to honor and serve him, descended from the sky accompanied by the sound of five hundred musical instruments, and remained before the Bhagavān.

source: བདག་ཅག་གིས་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་དང་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱི་ལྷའི་མདུན་ས་ཆོས་བཟང་ན་ཇི་ལྟ་བ་བཞིན་དུ་རིམ་གྲོ་དང་བསྙེན་བཀུར་བྱའོ། །གླུ་དབྱངས་དག་ཇི་ལྟར་ལེན་པ་དེ་བཞིན་དུ་དེང་ལྷའི་ལྷ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཡང་མཆོད་པའི་ཕྱིར་གླུ་དབྱངས་རབ་ཏུ་སྦྱར་རོ།
en: The gandharva Pañcaśikha thought, “Just as I render service and honor in Sudharma before the devas of Trāyastriṃśa and Śakra, the lord of the devas, by singing them songs, in that same way I shall sing in order to make an offering to the god of gods, the Tathāgata, the arhat, the perfectly enlightened Buddha.”

source: །དེ་ནས་དྲི་ཟའི་བུ་གཙུག་ཕུད་ལྔ་ཅན་སིལ་སྙན་ཐོགས་པ་ལྔ་བརྒྱ་པོ་དེ་དག་དང་སྒྲ་གཅིག་ཏུ་སྦྱར་ཏེ། པི་བང་གི་ཁོག་པ་བཻ་དཱུརྱ་ལས་བྱས་པ་དག་ཀྱང་ཐོགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བླངས་སོ།
en: Then the gandharva Pañcaśikha stood up before the Bhagavān holding a lute, the body of which was made of beryl. He was accompanied by the music of five hundred other gandharvas holding musical instruments.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་འདི་སྙམ་དུ་དགོངས་ཏེ། རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་ཇི་ལྟ་བུ་མངོན་པར་འདུ་བྱས་པས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ངེས་པར་རྟོགས་པ་ལ་མཁས་པ་འཐོབ་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་ལས་མི་གཡོ་བ་དང་། དྲི་ཟའི་བུ་གཙུག་ཕུད་ལྔ་ཅན་ལ་ཡང་རྒྱུད་ཀྱི་སྒྲ་དང་གླུའི་སྒྲ་ལ་མཁས་པ་བསྟན་པར་འགྱུར་བ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་ངས་བྱའོ་སྙམ་མོ།
en: The Bhagavān thought, “I shall perform a miracle so that the youth Candraprabha will attain skill in the realization of the inconceivable Dharma of the Buddha, so that he will not waver from the samādhi, the revealed equality of the nature of all phenomena, and so that I may manifest the gandharva Pañcaśikha’s skill in singing and playing the lute.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་མཛད་དེ། སངས་རྒྱས་ཀྱི་མཐུས་སིལ་སྙན་ལྔ་བརྒྱ་པོ་ཤིན་ཏུ་ལེགས་པར་སྦྱར་བ།
en: Then the Bhagavān performed that miracle, and through the power of the Buddha the five hundred instruments were played excellently.

source: ལེགས་པར་བླངས་པ་དེ་དག་ལས་བསམ་གྱིས་མི་ཁྱབ་པའི་དོན་དང་ལྡན་པ་ཆོས་ཉིད་དང་ལྡན་པའི་སྒྲ་བྱུང་ངོ་།
en: From that excellent playing there came the sound of the inconceivable meaning, which was united with the true nature.

source: །སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ངེས་པར་རྟོགས་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་ཀྱང་བྱུང་ངོ་།
en: And these verses of the realization of the inconceivable Dharma of the Buddha were sung:

source: །སྐྲ་གཅིག་ཁྱོན་ལ་སངས་རྒྱས་མང་པོ་ནི།
en: “Within the breadth of one hair there are as many buddhas

source: །གང་གཱའི་ཀླུང་གི་བྱེ་མ་ཅི་ཡོད་སྙེད།
en: As the number of grains of sand in the Ganges.

source: །རྒྱལ་བ་དེ་དག་ཞིང་ཡང་དེ་སྙེད་དེ།
en: And those jinas have as many buddha realms, too,

source: །དེ་དག་མཚན་ཉིད་མི་འདྲ་སྐལ་མི་མཉམ།
en: Each one separate and with distinct characteristics. {1}

source: །སྐྲ་ཡི་ཁྱོན་ལ་འགྲོ་བ་ལྔ་རྣམས་ཏེ།
en: “Within the breadth of one hair there are the five kinds of beings:

source: །སེམས་ཅན་དམྱལ་དང་དུད་འགྲོར་འགྲོ་བ་དང་། །གཤིན་རྗེའི་འཇིག་རྟེན་ལྷ་དང་མི་རྣམས་ཞུགས།
en: The beings in hell, those who are animals, Those in the realm of Yama, the devas, and humans,

source: །འདྲེས་པ་མེད་ཅིང་གནོད་པར་འགྱུར་བའང་མེད།
en: Without overlapping or being squeezed. {2}

source: །དེ་ཡི་གནས་སུ་མཚོ་དང་རྒྱ་མཚོར་བཅས།
en: “Within that space there are the lakes and oceans,

source: །ཆུ་ཀླུང་དེ་བཞིན་མཚེའུ་དང་ལྟེང་ཀ་རྣམས།
en: All rivers, and similarly ponds and springs,

source: །འདྲེས་པ་མེད་ཅིང་གནོད་པར་མི་འགྱུར་ཏེ།
en: Without overlapping or being squeezed.

source: །དེ་ལྟར་རྒྱལ་བའི་ཆོས་ནི་བསམ་མི་ཁྱབ།
en: In that way the Buddha’s Dharma is inconceivable. {3}

source: །དེ་ཡི་གནས་སུ་རི་བོ་དུ་མ་སྟེ།
en: “Within that space there are numerous mountains:

source: །ཁོར་ཡུག་དང་ནི་ལྷུན་པོ་རབ་ལྷུན་དང་། །བཏང་བཟུང་དང་ནི་བཏང་བཟུང་ཆེན་པོ་དང་། །འབིགས་བྱེད་བྱ་རྒོད་ཕུང་པོ་གངས་ཀྱི་རི།
en: Cakravāla, Meru, and Sumeru, Mucilinda and Mahāmucilinda, Vindhya, Gṛdhrakūṭa, and Himavat. {4}

source: །གནས་དེར་སེམས་ཅན་དམྱལ་བ་མི་བཟད་པ།
en: “Within that space there are the terrible hells,

source: །ཚ་དང་རབ་ཏུ་ཚ་བ་ཉམས་མི་དགའ།
en: The horrible Tāpana and Pratāpana.

source: །དེ་ན་སེམས་ཅན་དམྱལ་སྐྱེས་ཚོར་བ་ཡི།
en: Those who have fallen into those hells

source: །སྡུག་བསྔལ་དེ་དག་རྗེས་སུ་མྱོང་བར་བྱེད།
en: Experience the sensation of suffering. {5}

source: །དེ་ཡི་གནས་ན་ལྷ་ཡི་གཞལ་མེད་ཁང་།
en: “Within that space there are divine palaces,

source: །དེ་དག་དཔག་ཚད་བཅུ་གཉིས་དབྱངས་དགའ་བ།
en: Twelve yojanas in size and beautiful.

source: །ལྷ་རྣམས་སྟོང་ཕྲག་མང་པོ་དེ་དག་ཀྱང་།
en: Within them there are many thousands of devas

source: །ལྷ་ཡི་དགའ་བ་ཤིན་ཏུ་བདེ་བ་མྱོང་།
en: Who experience bliss in divine pleasures. {6}

source: །དེ་ཡི་གནས་སུ་སངས་རྒྱས་རྣམས་སྐྱེ་ཞིང་།
en: “Within that space there are the births of buddhas.

source: །འཇིག་རྟེན་རིག་པའི་བསྟན་པ་འབར་བ་སྣང་།
en: There is illumination from the teaching of those who know the world.

source: །གང་གིས་རྣམ་དག་སྤྱོད་པ་མ་སྦྱངས་པ།
en: Those who have not trained in pure conduct

source: །ཡེ་ཤེས་བྲལ་བ་དག་གིས་དེ་མི་མཐོང་།
en: And who have no wisdom will not see them. {7}

source: །དེ་ཡི་གནས་ཉིད་ན་ཡང་ཆོས་ནུབ་ཅིང་།
en: “Within that space they hear the words,

source: །འདྲེན་པ་མྱ་ངན་འདས་པའི་སྒྲ་ཡང་ཐོས།
en: ‘The Dharma has ceased, the Guide has passed away.’

source: །དེ་ཡི་གནས་ཉིད་ན་ཡང་ལ་ལ་ཡིས།
en: Within that space there are some who hear,

source: །འདྲེན་པ་བཞུགས་ཏེ་ཆོས་ཀྱང་སྟོན་ཅེས་ཐོས།
en: ‘The Guide lives and he teaches the Dharma.’ {8}

source: །དེ་ཡི་གནས་ཉིད་ན་ཡང་ལ་ལ་དག །ཚེ་ཚད་ལོ་ནི་བསམ་ཡས་བཞུགས་སྙམ་འཛིན།
en: “Within that space there are some who perceive That they live for countless years.

source: །དེ་ཡི་གནས་ནའང་འཆི་བའི་དུས་བྱེད་ཅིང་།
en: Within that space there are those whose time is ending.

source: །རིང་དུ་མི་འཚོ་ཞེས་ནི་སྒྲ་ཡང་ཐོས།
en: They hear the words, ‘You have not long to live.’ {9}

source: །གནས་དེར་ལ་ལ་འདི་སྙམ་འདུ་ཤེས་ཏེ།
en: “Within that space there are some who have the perception,

source: །ཡིད་ཀྱི་འདུ་ཤེས་དང་ནི་འཛིན་པ་ཡིས།
en: Believing what their mind perceives,

source: །བདེ་གཤེགས་མཐོང་མཆོད་སངས་རྒྱས་མཉེས་བྱས་སྙམ།
en: Of seeing and making offerings to sugatas and pleasing the buddhas.

source: །སྐྱེས་པ་མེད་ཅིང་མཆོད་པ་བྱས་པའང་མེད།
en: Yet there is no arising and no making of offerings. {10}

source: །མི་དག་བདག་གི་ཁྱིམ་ན་རྨི་ལམ་བཞིན།
en: “A man dreams he is in a house

source: །འདོད་པའི་ཡོན་ཏན་དག་ལ་དགའ་མྱོང་ནས།
en: Experiencing the bliss of sensory pleasures.

source: །ཕྱིར་སད་ནས་ཀྱང་དེ་ཡིས་གདོད་མ་མཐོང་།
en: When he awakes he does not see those pleasures.

source: །དེ་ནི་རྨི་ལམ་ཡིན་པར་དེ་ཡིས་ཤེས།
en: He knows that it was a dream. {11}

source: །དེ་བཞིན་མཐོང་ཐོས་རིག་དང་བྱེ་བྲག་ཕྱེད།
en: “In that way, what is seen, heard, thought, or known,

source: །འདི་དག་ཐམས་ཅད་མི་བདེན་རྨི་ལམ་བཞིན།
en: All of this is unreal, like a dream.

source: །གང་གིས་ཏིང་འཛིན་འདི་ཡང་ཐོབ་གྱུར་པ།
en: The one who has attained the samādhi

source: །དེས་ནི་ཆོས་ཀྱི་རང་བཞིན་འདི་དག་ཤེས།
en: Will know this nature of phenomena. {12}

source: །སུ་ལའང་སྡུག་དང་མི་སྡུག་མེད་པ་ནི།
en: “For people such as this there is no pleasure or displeasure.

source: །མི་དེ་འཇིག་རྟེན་ན་ཡང་བདེ་སྐྱིད་རྟག །སུ་དག་ནགས་ཁྲོད་མངོན་པར་དགའ་བ་ཡི།
en: They are always perfectly happy in the world. Those who delight in vast forests

source: །དགེ་སྦྱོང་དེ་ནི་ཤིན་ཏུ་བདེ་བ་མྱོང་།
en: Become perfectly happy mendicants. {13}

source: །སུ་དག་ཅི་ལའང་བདག་གིར་བྱ་བ་མེད།
en: “Those who have no thought of ‘mine,’

source: །ཡོངས་སུ་འཛིན་པ་རྣམ་པ་ཀུན་ཏུ་སྤངས།
en: Those who have abandoned all attachments,

source: །བསེ་རུ་བཞིན་དུ་འཇིག་རྟེན་འདི་ན་གནས།
en: Wander in the world like rhinoceroses

source: །ནམ་མཁའ་ལ་ནི་རླུང་དག་རྒྱུ་བ་བཞིན།
en: And roam like the wind through the air. {14}

source: །ལམ་རྣམས་བསྒོམས་ཤིང་ཡེ་ཤེས་རབ་ཏུ་ཞུགས།
en: “Meditation on the path, the development of wisdom,

source: །ཆོས་རྣམས་ཐམས་ཅད་སྟོང་པ་བདག་མེད་པར།
en: The emptiness and selflessness of all phenomena:

source: །ཆོས་རྣམས་འདི་དག་གང་གིས་རབ་བསྒོམས་པ།
en: He who meditates on these Dharmas

source: །སུ་དག་འཇིག་རྟེན་ན་ནི་ཡིད་ཆགས་མེད།
en: “The people in the world whose minds have no attachment, They are perfectly happy in this world.

source: །དེ་དག་སེམས་ནི་རྟག་ཏུ་རླུང་དང་འདྲ།
en: Their minds are always like the wind,

source: །སྡུག་དང་མི་སྡུག་ལ་ཡང་ཆགས་པ་མེད། །འཇིག་རྟེན་ན་ནི་མི་དེ་ཤིན་ཏུ་སྐྱིད།
en: Knowing no attachment to pleasure or displeasure. {16}

source: །མི་སྡུག་པ་དང་འགྲོགས་པ་སྡུག་བསྔལ་ཏེ།
en: “It is suffering to be with that which is unpleasant;

source: །སྡུག་པ་དང་ཡང་བྲལ་བ་སྡུག་བསྔལ་ཡིན།
en: It is suffering to be separated from that which is pleasant.

source: །མཐར་བྱས་འདི་གཉིས་རབ་ཏུ་སྤངས་ནས་ནི།
en: Finally abandoning both of these,

source: །མི་གང་ཆོས་ལ་དགའ་བ་དེ་དག་སྐྱིད།
en: Those happy people delight in the Dharma. {17}

source: །གང་ཞིག་ཆོས་འདི་ཐོས་ནས་ཆགས་བྱེད་ཅིང་།
en: “The one who has attachment on hearing this Dharma,

source: །ཆོས་མ་ཡིན་པ་ཐོས་ནས་ཁོང་ཁྲོ་བྱེད།
en: And animosity on hearing that which is not Dharma,

source: །ང་རྒྱལ་རྒྱགས་པས་བཅོམ་པ་ལོག་པ་དེ།
en: Goes astray through conceit and pride,

source: །ང་རྒྱལ་དབང་གིས་སྡུག་བསྔལ་རྗེས་སུ་མྱོང་།
en: And overpowered by pride, experiences suffering. {18}

source: །སུ་དག་མཉམ་པ་ཉིད་ལ་རབ་གནས་ཏེ།
en: “Those who remain in equanimity

source: །རྟག་ཏུ་ཁེངས་པ་མེད་ཅིང་འདུད་པ་མེད།
en: Are always free of arrogance and depression.

source: །སྡུག་དང་མི་སྡུག་པ་ལས་རབ་གྲོལ་བ།
en: When faced with the pleasant and the unpleasant

source: །དེ་དག་རྟག་ཏུ་གྲོལ་ཡིད་ལེགས་པར་གནས།
en: They always have a liberated mind. {19}

source: །ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པར་རབ་གནས་ཏེ།
en: “Those who maintain perfectly pure correct conduct,

source: །བསམ་གཏན་བསམ་མི་ཁྱབ་ལ་རྟག་གནས་ཤིང་།
en: Who remain always in inconceivable dhyāna

source: །སུ་དག་ནགས་ཁྲོད་ཞི་བར་དགའ་བ་ནི།
en: And delight in the peace of the forests,

source: །དེ་དག་ནམ་ཡང་ཡིད་གཉིས་ཡོང་མི་འགྱུར།
en: Will never know the arising of doubts. {20}

source: །མི་བདེན་པ་ལ་སུ་དག་རབ་ཞུགས་ཤིང་།
en: “Those who engage in that which is unreal,

source: །བྱིས་པ་འདོད་པའི་ཡོན་ཏན་རྟག་ཏུ་དགའ།
en: The fools who are always enjoying sensory pleasures

source: །བྱ་རྒོད་དག་ནི་རོ་ལ་མོས་པ་བཞིན།
en: Like vultures attracted to a corpse,

source: །དེ་དག་རྟག་པར་བདུད་ཀྱི་དབང་དུ་འགྲོ།
en: They always fall under the power of Namuci.” {21}

source: །ཡང་པི་བང་གི་སྒྲ་དེ་ལས་ཚིགས་སུ་བཅད་པ་མངོན་པར་བསྒྲུབ་པ་འདི་བྱུང་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ཟབ་མོ་ངེས་པར་རྟོགས་པ་ལ་མཁས་པ་རྗེས་སུ་ཐོབ་བོ།
en: When these verses had been created through the sound of the lutes, the youth Candraprabha attained skill in the realization of the inconceivable Dharma of the Buddha;

source: །དྲི་ཟའི་བུ་གཙུག་ཕུད་ལྔ་ཅན་ཡང་སྒྲའི་རྗེས་སུ་འགྲོ་བའི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: the gandharva Pañcaśikha attained the patience that was in accord with that sound;

source: །ལྷ་དང་མི་ཡི་སྐྱེ་དགུ་སེམས་ཅན་དཔག་ཏུ་མེད་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ།
en: countless beings, both devas and humans, developed the aspiration to the highest, complete enlightenment;

source: །སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་ཡང་དོན་བྱས་པར་གྱུར་ཏོ།
en: and countless beings were benefitted.

source: །སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ངེས་པར་བསྟན་པའི་ལེའུ་སྟེ་བཅུ་དགུ་པའོ།། །།
en: Conclusion of the nineteenth chapter, “The Teaching of the Inconceivable Dharma of the Buddha.” Indra­ketu­dhvaja­rāja Chapter 20

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་ལ་འཇུག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འདོད་པ་དང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་དགེ་བའི་རྩ་བ་དང་བསླབས་པ་དང་ཡོན་ཏན་གྱི་ཚོགས་ཐམས་ཅད་གདོན་མི་ཟ་ཞིང་ཚུལ་ཁྲིམས་ཤིན་ཏུ་ཡོངས་སུ་དག་པར་བྱའོ།
en: Then the Bhagavān said to the youth Candraprabha, “Young man, in that way bodhisattva mahāsattvas who wish for this Dharma teaching of entering great compassion and wish to attain the highest, complete enlightenment of perfect buddhahood quickly should rely upon all roots of merit, training, qualities, and completely pure conduct.
